src/Documents/ДемоРасходнаяНакладная/ДемоРасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДемоРасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ДемоОстаткиТоваров</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.ДемоНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ДемоОстаткиТоваров/ДемоОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДемоОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.ДемоНоменклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ДемоРасходнаяНакладная/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДемоРасходнаяНакладнаяТовары.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ДемоРасходнаяНакладнаяТовары.Товар,
		|	ДемоРасходнаяНакладнаяТовары.Количество
		|ИЗ
		|	Документ.ДемоРасходнаяНакладная.Товары КАК ДемоРасходнаяНакладнаяТовары
		|ГДЕ
		|	ДемоРасходнаяНакладнаяТовары.Ссылка = &Ссылка";
		
	Движения.ДемоОстаткиТоваров.Записывать = Истина;
	Движения.ДемоОстаткиТоваров.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти
